package hw7;

public class SumOfTwoNum {
    public static void main(String[] args) {
        System.out.println(sumOfTwoNumbers(1, 7));

    }
    //    2. Создайте метод sum - который в качестве аргумента берет 2 целых числа и возвращает их сумму.
//вызовите этот метод внутри функии main(), сохраните результат в переменной и выведите результат на экран (подсказка - тип функции будет int)
    public static int sumOfTwoNumbers(int a, int b){
        int d=a+b;
        return d;
    }
}
